batsignal
battmon
ctop-bin
dtags
font-manager
fpp
fromscratch-bin
googler
gotags-git
i3keys
i3lock-color
laptop-mode-tools
numix-cursor-theme
numix-frost-themes
picgo-appimage
popular-packages
rpi-imager
siji-git
ttf-ancient-fonts
ttf-font-icons
ttf-ms-fonts
ttf-weather-icons
wps-office-fonts
xmind-2020
