batsignal
battmon
ctop-bin
dtags
font-manager
fromscratch-bin
googler
gotags-git
i3keys
i3lock-color
laptop-mode-tools
neovim-symlinks
nodejs-neovim
numix-cursor-theme
numix-frost-themes
picgo-appimage
popular-packages
python2-pynvim
rpi-imager
ruby-neovim
ttf-ancient-fonts
ttf-font-icons
ttf-meslo-nerd-font-powerlevel10k
ttf-ms-fonts
ttf-weather-icons
wps-office
wps-office-fonts
wps-office-mime
wps-office-mui-zh-cn
xmind-2020
zsh-theme-powerlevel10k-git
