acpi
adobe-source-han-sans-cn-fonts
adobe-source-han-serif-cn-fonts
alsa-firmware
alsa-utils
appmenu-gtk-module
arandr
arch-install-scripts
archlinuxcn-keyring
archlinuxcn-mirrorlist-git
asciinema
autoconf
autojump
automake
autopep8
awesome-terminal-fonts
axel
baidupcs-go
bandwhich
base
bash
bash-completion
bat
bbswitch
bdf-unifont
bind
bison
bluez
bluez-utils
breeze-icons
busybox
bzip2
catimg
ccache
cfitsio
chafa
chromium
ciano
cmake
cmatrix
colordiff
container-diff
coreutils
cpio
cppcheck
cpupower
cryptsetup
ctags
d-feet
dbeaver
device-mapper
dialog
diffutils
dkms
dmidecode
dnsmasq
docker
docker-compose
docker-machine
dunst
e2fsprogs
ebtables
efibootmgr
efivar
elinks
emacs
ethtool
exa
exfat-utils
fakeroot
fcitx5
fcitx5-chinese-addons
fcitx5-configtool
fcitx5-gtk
fcitx5-lua
fcitx5-material-color
fcitx5-pinyin-moegirl
fcitx5-pinyin-zhwiki
fdupes
feh
file
filesystem
filezilla
findutils
firefox
firefox-i18n-zh-cn
flake8
flex
freetds
fwupd
fzf
galculator
gawk
gcc
gcc-libs
gdb
gettext
git
git-lfs
glibc
gnome-disk-utility
gnome-icon-theme
gnome-keyring
gnu-netcat
go
gpick
grep
gtk-chtheme
guake
gvfs-mtp
gvfs-smb
gvim
gzip
hardinfo
hdparm
hexer
htop
hugo
i3-gaps
i7z
inetutils
intel-gpu-tools
intel-media-driver
intel-media-sdk
intel-ucode
iproute2
iputils
ipython
jdk-openjdk
jq
less
lhasa
libspectre
libusb-compat
libva-intel-driver
libva-utils
libvirt
licenses
linux
linux-firmware
linux-headers
lldb
logrotate
lsb-release
lshw
lsof
luit
lvm2
make
man-db
man-pages
mate-polkit
mdadm
meld
mesa-demos
mlocate
mpc
mpd
mpv
msr-tools
ncdu
neofetch
net-tools
netease-cloud-music-gtk
network-manager-applet
networkmanager
nim
nimble
nmap
noto-fonts-cjk
noto-fonts-emoji
noto-fonts-extra
ntfs-3g
nuspell
nvme-cli
p7zip
pacgraph
pacman
pacman-contrib
pandoc
pass
patch
pavucontrol
pciutils
peek
perl
perl-anyevent-i3
picom
pipewire
pkgconf
pkgfile
polybar
postgresql-libs
postman-bin
powerline-fonts
powertop
procps-ng
profile-cleaner
progress
psmisc
pulseaudio
pulseaudio-alsa
pv
python-automat
python-beautifulsoup4
python-constantly
python-hyperlink
python-isort
python-lxml
python-pyflakes
python-pyqt5
python-shiboken2
python-virtualenv
python-virtualenvwrapper
qbittorrent
qemu-headless
qt5-networkauth
qt5-quickcontrols2
qt5-serialport
quota-tools
ranger
redshift
rofi
rofi-calc
rustup
sddm
seahorse
sed
shadow
shellcheck
shfmt
shiboken2
sl
smem
speedtest-cli
sshfs
sudo
sysfsutils
systemd-boot-pacman-hook
systemd-sysvcompat
tar
task
tcpdump
terminator
texinfo
the_silver_searcher
thefuck
thunar
thunar-archive-plugin
thunar-media-tags-plugin
thunar-volman
thunderbird
thunderbird-i18n-zh-cn
tig
time
tk
tldr
tokei
trash-cli
tree
ttf-anonymous-pro
ttf-droid
ttf-font-awesome
ttf-hack
ttf-ionicons
ttf-liberation
ttf-monaco
ttf-opensans
ttf-roboto
ttf-wps-fonts
typespeed
typora
udevil
unarchiver
unrar
unzip-iconv
upower
usbutils
util-linux
v2ray
virt-manager
w3m
wget
which
whois
wireless_tools
wmname
wpa_supplicant
wps-office
wps-office-mime
wps-office-mui-zh-cn
wqy-microhei
wqy-zenhei
xarchiver
xchm
xdg-user-dirs
xf86-video-intel
xfce4-taskmanager
xfsprogs
xorg-bdftopcf
xorg-docs
xorg-font-util
xorg-fonts-100dpi
xorg-fonts-75dpi
xorg-fonts-misc
xorg-iceauth
xorg-server-devel
xorg-server-xephyr
xorg-server-xnest
xorg-server-xvfb
xorg-server-xwayland
xorg-sessreg
xorg-smproxy
xorg-x11perf
xorg-xbacklight
xorg-xcmsdb
xorg-xcursorgen
xorg-xdpyinfo
xorg-xdriinfo
xorg-xev
xorg-xgamma
xorg-xhost
xorg-xinput
xorg-xkbevd
xorg-xkbutils
xorg-xkill
xorg-xlsatoms
xorg-xlsclients
xorg-xmodmap
xorg-xpr
xorg-xprop
xorg-xrandr
xorg-xrdb
xorg-xrefresh
xorg-xsetroot
xorg-xvinfo
xorg-xwd
xorg-xwininfo
xorg-xwud
xreader
xsel
yapf
yay
ydcv-rs-git
youtube-dl
zenity
zip
zsh
zsh-autosuggestions
zsh-completions
zsh-syntax-highlighting
zssh
